jantielens/esp32-macropad/src/app/device_telemetry.cpp
#include "device_telemetry.h"

#include "config_manager.h"
#include "log_manager.h"
#include "board_config.h"
#include "fs_health.h"
#include "sensors/sensor_manager.h"
#include "image_fetch.h"

#include <Arduino.h>
#include <WiFi.h>
#include "soc/soc_caps.h"
#include <esp_heap_caps.h>
#include <esp_attr.h>
#include <esp_rom_sys.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <freertos/timers.h>
#include <freertos/idf_additions.h>
#include <esp_timer.h>
#include <esp_idf_version.h>

// Per-core idle-task run-time counter API was added in ESP-IDF v5.x.
// Inkplate's bundled arduino-esp32 fork ships an older IDF (4.x) that lacks
// `configRUN_TIME_COUNTER_TYPE` and `ulTaskGetIdleRunTimeCounterForCore`. On
// that platform we compile out the per-core sampler entirely and report -1.
#if (ESP_IDF_VERSION_MAJOR >= 5)
#define TELEMETRY_HAS_PER_CORE_IDLE_COUNTER 1
#else
#define TELEMETRY_HAS_PER_CORE_IDLE_COUNTER 0
#endif

#if HAS_MQTT
#include "mqtt_manager.h"
#endif

#if HAS_DISPLAY
#include "display_manager.h"
#endif

#if HAS_BLE_HID
#include "ble_hid.h"
extern DeviceConfig device_config;
#endif

// Temperature sensor support (ESP32-C3, ESP32-S2, ESP32-S3, ESP32-C2, ESP32-C6, ESP32-H2)
#if SOC_TEMP_SENSOR_SUPPORTED
#include "driver/temperature_sensor.h"
#endif

// Cached WiFi RSSI — sampled once at boot (and optionally on reconnect) to
// avoid repeated ESP-Hosted RPC calls from the hot health-publish path.
static int16_t s_cached_rssi = 0;
static bool    s_rssi_valid  = false;

void device_telemetry_cache_rssi() {
	if (WiFi.status() == WL_CONNECTED) {
		s_cached_rssi = WiFi.RSSI();
		s_rssi_valid  = true;
		LOGI("Telemetry", "Cached WiFi RSSI: %d dBm", (int)s_cached_rssi);
	}
}

int16_t device_telemetry_get_cached_rssi(bool *valid) {
	if (valid) *valid = s_rssi_valid;
	return s_cached_rssi;
}

// CPU usage tracking — uses FreeRTOS per-core idle-task run-time counters.
// `ulTaskGetIdleRunTimeCounterForCore()` (ESP-IDF addition) reads a single
// uint32 from the idle-task TCB — no scheduler suspension, no task-list walk.
// A 1 Hz esp_timer computes the delta and derives CPU%.
#if TELEMETRY_HAS_PER_CORE_IDLE_COUNTER
static configRUN_TIME_COUNTER_TYPE s_idle_rt_last[portNUM_PROCESSORS] = {};
static int64_t           s_wall_us_last = 0;
static bool              s_cpu_first_sample = true;
#endif
static portMUX_TYPE      s_cpu_usage_mux = portMUX_INITIALIZER_UNLOCKED;
static int               s_cpu_usage = -1;
static int               s_cpu_usage_per_core[portNUM_PROCESSORS] = {};
static esp_timer_handle_t s_cpu_timer = nullptr;

// /api/health min/max window sampling (time-based rollover).
// Goal: capture short-lived dips/spikes without storing time series on-device.
// IMPORTANT:
// - Do NOT reset sampling on HTTP requests (multiple clients would interfere).
// - We keep a small "last" window and a "current" window and report a merged
//   snapshot, which is stable across multiple clients and makes a reasonable
//   effort to not miss spikes around rollover boundaries.
static portMUX_TYPE g_health_window_mux = portMUX_INITIALIZER_UNLOCKED;
static TimerHandle_t g_health_window_timer = nullptr;

static constexpr uint32_t kHealthWindowSamplePeriodMs = HEALTH_WINDOW_SAMPLE_PERIOD_MS;
static constexpr uint32_t kInternalPoolWalkPeriodMs = TELEMETRY_INTERNAL_POOL_WALK_PERIOD_MS;

static size_t g_cached_internal_largest = 0;
static size_t g_cached_dma_internal_largest = 0;
static bool g_cached_internal_largest_valid = false;
static uint32_t g_last_internal_pool_walk_ms = 0;

struct HealthWindowStats {
		bool initialized;

		size_t internal_free_min;
		size_t internal_free_max;

		size_t psram_free_min;
		size_t psram_free_max;
};

static HealthWindowStats g_health_window_current = {};
static HealthWindowStats g_health_window_last = {};
static bool g_health_window_last_valid = false;

static unsigned long g_health_window_current_start_ms = 0;
static unsigned long g_health_window_last_start_ms = 0;
static unsigned long g_health_window_last_end_ms = 0;

static void health_window_reset() {
		portENTER_CRITICAL(&g_health_window_mux);
		g_health_window_current = {};
		g_health_window_last = {};
		g_health_window_last_valid = false;
		g_health_window_current_start_ms = millis();
		g_health_window_last_start_ms = 0;
		g_health_window_last_end_ms = 0;
		portEXIT_CRITICAL(&g_health_window_mux);
}

static int compute_fragmentation_percent(size_t free_bytes, size_t largest_bytes) {
		if (free_bytes == 0) return 0;
		if (largest_bytes > free_bytes) return 0;
		float frag = (1.0f - ((float)largest_bytes / (float)free_bytes)) * 100.0f;
		if (frag < 0) frag = 0;
		if (frag > 100) frag = 100;
		return (int)frag;
}

static void health_window_update_sample(size_t internal_free, size_t psram_free) {
		const unsigned long now_ms = millis();

		portENTER_CRITICAL(&g_health_window_mux);

		if (g_health_window_current_start_ms == 0) {
				g_health_window_current_start_ms = now_ms;
		}

		// Time-based rollover (shared across all clients).
		// Roll over BEFORE applying the sample so the boundary sample belongs to the new window.
		if ((uint32_t)(now_ms - g_health_window_current_start_ms) >= (uint32_t)HEALTH_POLL_INTERVAL_MS) {
				if (g_health_window_current.initialized) {
						g_health_window_last = g_health_window_current;
						g_health_window_last_valid = true;
						g_health_window_last_start_ms = g_health_window_current_start_ms;
						g_health_window_last_end_ms = now_ms;
				}

				g_health_window_current = {};
				g_health_window_current_start_ms = now_ms;
		}

		if (!g_health_window_current.initialized) {
				g_health_window_current.initialized = true;

				g_health_window_current.internal_free_min = internal_free;
				g_health_window_current.internal_free_max = internal_free;
				g_health_window_current.psram_free_min = psram_free;
				g_health_window_current.psram_free_max = psram_free;

				portEXIT_CRITICAL(&g_health_window_mux);
				return;
		}

		if (internal_free < g_health_window_current.internal_free_min) g_health_window_current.internal_free_min = internal_free;
		if (internal_free > g_health_window_current.internal_free_max) g_health_window_current.internal_free_max = internal_free;
		if (psram_free < g_health_window_current.psram_free_min) g_health_window_current.psram_free_min = psram_free;
		if (psram_free > g_health_window_current.psram_free_max) g_health_window_current.psram_free_max = psram_free;

		portEXIT_CRITICAL(&g_health_window_mux);
}

